# Development: Tools
brew 'bat'
cask 'db-browser-for-sqlite'
brew 'dotbot'
brew 'fd'
brew 'fzf'
brew 'gcc'
brew 'gdb'
brew 'git'
brew 'htop'
brew 'kitty'
brew 'macos-trash'
brew 'neovim'
brew 'renameutils'
brew 'ripgrep'
brew 'sqlite'
brew 'starship'
brew 'tree'
brew 'wget'  # Mason.nvim dependency
brew 'z'
brew 'zsh'
brew 'zsh-syntax-highlighting'


# Development: Languages
# brew 'go'
brew llvm  # Provides clang compiler and clangd language server
# cask smlnj
# brew 'node'
# brew 'php'
brew 'python3'


# Emacs
# Formula recommended by Doom
# (https://github.com/hlissner/doom-emacs/blob/master/docs/getting_started.org#on-macos):
# tap 'railwaycat/emacsmacport'
# brew 'emacs-mac --with-modules'


# General Applications and Utilities
brew calc 
# brew 'ffmpeg'
# brew 'youtube-dl'


# Fonts (including NERD Fonts)
tap 'homebrew/cask-fonts'

  # Standard Monospace Fonts
  # brew 'font-cascadia-code'
  brew 'font-fantasque-sans-mono'
  # brew 'font-fantasque-sans-mono-noloopk'  # lowercase k without loop
  # brew 'font-fira-code'
  # brew 'font-hack'
  brew 'font-ibm-plex-mono'
  brew 'font-iosevka'
  brew 'font-iosevka-slab'
  brew 'font-jetbrains-mono'
  # brew 'font-meslo-lg'
  # brew 'font-meslo-lg-dz'  # dotted zero
  brew 'font-noto-sans-mono'
  # brew 'font-pt-mono'  # Included with macOS
  brew 'font-roboto-mono'
  brew 'font-source-code-pro'
  brew 'font-victor-mono'

  # NERD Monospace Fonts
  # brew 'font-blex-mono-nerd-font'
  # brew 'font-fantasque-sans-mono-nerd-font'
  # brew 'font-fira-code-nerd-font'
  # brew 'font-hack-nerd-font'
  # brew 'font-iosevka-nerd-font'
  # brew 'font-meslo-lg-nerd-font'
  # brew 'font-roboto-mono-nerd-font'
  # brew 'font-sauce-code-pro-nerd-font'

  # Variable Fonts
  brew 'svn'  # Needed to install font-source-sans-pro
  brew 'font-source-sans-pro'
