# Brewfile
# Author: Dan Murphy

# Development
brew 'fish'
brew 'gcc'
brew 'go'   # Needed by Vim package Hexokinase
brew 'git'
brew 'macos-trash'
brew 'neovim'
brew 'python3'
brew 'sqlite'
brew 'starship'
brew 'tree'
brew 'zsh'
brew 'zsh-syntax-highlighting'

cask 'alacritty'
cask 'db-browser-for-sqlite'


# Fonts (including NERD Fonts)
tap 'homebrew/cask-fonts'
brew 'font-fira-code-nerd-font'


# Other
brew 'ffmpeg'
brew 'youtube-dl'

