# Development: Tools
brew 'bat'
cask 'db-browser-for-sqlite'
brew 'dotbot'
brew 'fd'
brew 'fzf'
brew 'gcc'
brew 'gdb'
brew 'gh'  # GitHub CLI
brew 'git'
brew 'git-delta'
brew 'httpie'
brew 'httpyac'
brew 'htop'
brew 'kitty'
brew 'jesseduffield/lazygit/lazygit'
brew 'macos-trash'
brew 'neovim'
brew 'renameutils'
brew 'ripgrep'
brew 'sqlite'
brew 'starship'
brew 'thefuck'
brew 'tlrc'
brew 'tree'
cask 'wezterm'
brew 'wget'  # Mason.nvim dependency
brew 'zsh'
brew 'zsh-syntax-highlighting'


# Development: Languages
cask 'dotnet-sdk'
brew 'go'
brew 'llvm'  # Provides clang compiler and clangd language server
brew 'node'
brew 'pnpm'
brew 'python3'
# brew 'jruby'
# brew 'php'
# cask smlnj

# Haskell
brew ghc@9.6  # GHC 9.6.3 is the latest supported by HLS
brew cabal-install
brew haskell-stack
brew haskell-language-server


# General Applications and Utilities
brew calc 


# Fonts (including NERD Fonts)

  # Standard Monospace Fonts
  brew 'font-fira-code'
  brew 'font-ibm-plex-mono'
  brew 'font-iosevka'
  brew 'font-iosevka-slab'
  brew 'font-jetbrains-mono'
  brew 'font-source-code-pro'

  # NERD Monospace Fonts
  brew 'font-blex-mono-nerd-font'
  brew 'font-symbols-only-nerd-font'  #Stand-alone NERD Font symbols, for use with kitty

  # Variable Fonts
  brew 'svn'  # Needed to install font-source-sans-pro
  brew 'font-lato'
  brew 'font-open-sans'
  brew 'font-source-sans-pro'
