# Brewfile
# Author: Dan Murphy

# Development
brew 'bat'
brew 'fd'   # Optional Doom Emacs dependency
brew 'gcc'
brew 'gdb'
brew 'git'
brew 'go'   # Needed by Vim package Hexokinase
brew 'htop'
brew 'macos-trash'
brew 'neovim'
brew 'node'  # Needed by VS Code Live Preview extension
brew 'php'
brew 'python3'
brew 'ripgrep'  # Doom Emacs dependency
brew 'sqlite'
brew 'starship'
brew 'stow'
brew 'tree'
brew 'zsh'
brew 'zsh-syntax-highlighting'

cask 'alacritty'
cask 'db-browser-for-sqlite'


# Emacs formula recommended by Doom:
# https://github.com/hlissner/doom-emacs/blob/master/docs/getting_started.org#on-macos
tap 'railwaycat/emacsmacport'
brew 'emacs-mac --with-modules'


# Fonts (including NERD Fonts)
tap 'homebrew/cask-fonts'

  # Standard Monospace Fonts
  brew 'font-cascadia-code'
  brew 'font-fantasque-sans-mono'
  #brew 'font-fantasque-sans-mono-noloopk'  # lowercase k without loop
  brew 'font-fira-code'
  brew 'font-hack'
  brew 'font-ibm-plex-mono'
  brew 'font-iosevka'
  brew 'font-jetbrains-mono'
  brew 'font-meslo-lg'
  #brew 'font-meslo-lg-dz'  # dotted zero
  brew 'font-roboto-mono'
  brew 'font-source-code-pro'

  # NERD Monospace Fonts
  brew 'font-blex-mono-nerd-font'
  brew 'font-fantasque-sans-mono-nerd-font'
  brew 'font-fira-code-nerd-font'
  brew 'font-hack-nerd-font'
  brew 'font-iosevka-nerd-font'
  brew 'font-meslo-lg-nerd-font'
  brew 'font-roboto-mono-nerd-font'
  brew 'font-sauce-code-pro-nerd-font'

  # Variable Fonts
  brew 'font-source-sans-pro'


# Other
brew 'ffmpeg'
brew 'youtube-dl'

